In [11]:
import pandas as pd
import numpy as np

In [12]:
# 1. KLASIFIKASI SKOR TOTAL SISWA

# Load data siswa
df_siswa = pd.read_csv("files/data_CTnorm_siswa.csv", sep=';')
print("\nJumlah data siswa:", len(df_siswa))

print("\nData Siswa:")
df_siswa[["Nama", "Kategori", "Nilai", "CT_norm"]].head()

Jumlah data siswa: 1678

Data Siswa:

                      Nama Kategori  Nilai  CT_norm
0    Aaron Nathanael Yules    Siaga  12.92    0.321
1  Abraham Giovani Soediro    Siaga   3.61    0.228
2    Abyatar Putra Nugraha    Siaga  23.75    0.428
3         Adelle Dwi Alexa    Siaga  29.58    0.486
4  Adrea Naryama Bellvania    Siaga  11.25    0.304

In [13]:
# 2. KLASIFIKASI SKOR TOTAL

# Cek Trisection 
q33 = df_siswa["CT_norm"].quantile(0.33).round(3)
q66 = df_siswa["CT_norm"].quantile(0.66).round(3)

print("\nCek Trisection CT_norm Siswa:")
print("\nNilai CT_norm pada kuartil 33%  :", q33)
print("Nilai CT_norm pada kuartil 66%  :", q66)

Cek Trisection CT_norm Siswa:

Nilai CT_norm pada kuartil 33%  : 0.263
Nilai CT_norm pada kuartil 66%  : 0.411

In [14]:
# Klasifikasi siswa
def klasifikasi_ct(x):
    if x <= q33:
        return 'Rendah'
    elif x <= q66:
        return 'Sedang'
    else:
        return 'Tinggi'

df_siswa['Level_CT'] = df_siswa['CT_norm'].apply(klasifikasi_ct)

print("\nKlasifikasi Level CT Siswa:")
df_siswa[['Nama', 'CT_norm', 'Level_CT']].head()

Klasifikasi Level CT Siswa:

                      Nama  CT_norm Level_CT
0    Aaron Nathanael Yules    0.321   Sedang
1  Abraham Giovani Soediro    0.228   Rendah
2    Abyatar Putra Nugraha    0.428   Tinggi
3         Adelle Dwi Alexa    0.486   Tinggi
4  Adrea Naryama Bellvania    0.304   Sedang

In [15]:
# 3. JUMLAH SISWA PER KLASIFIKASI LEVEL CT

# Hitung siswa per level CT
jumlah_siswa = df_siswa['Level_CT'].value_counts().sort_index()
persentase = (jumlah_siswa / jumlah_siswa.sum() * 100).round(2)

tabel_ct = pd.DataFrame({
    'Level': jumlah_siswa.index,
    'Jumlah Siswa': jumlah_siswa.values,
    'Persentase (%)': persentase.values
})

print("\nTabel Distribusi Tingkat Literasi Digital Siswa")
tabel_ct

Tabel Distribusi Tingkat Literasi Digital Siswa

    Level  Jumlah Siswa  Persentase (%)
0  Rendah           554           33.02
1  Sedang           561           33.43
2  Tinggi           563           33.55

In [16]:
# CEK OUTPUT DATA SISWA
df_siswa[[
    "Id",
    "Nama",
    "SekolahNama",
    "Kelas",
    "Kategori",
    "Nilai",
    "CT_norm",
    "Level_CT"
]].head()

,Id,Nama,SekolahNama,Kelas,Kategori,Nilai,CT_norm,Level_CT
0,318534,Aaron Nathanael Yules,SD Kristen Banjarsari,4,Siaga,12.92,0.321,Sedang
1,318530,Abraham Giovani Soediro,SD Kristen Banjarsari,6,Siaga,3.61,0.228,Rendah
2,288718,Abyatar Putra Nugraha,SD Kristen Manahan Surakarta,6,Siaga,23.75,0.428,Tinggi
3,288860,Adelle Dwi Alexa,SD Kristen Manahan Surakarta,6,Siaga,29.58,0.486,Tinggi
4,318500,Adrea Naryama Bellvania,SD Kristen Banjarsari,5,Siaga,11.25,0.304,Sedang

In [17]:
# pilih kolom yang mau disimpan
df_save_siswa = df_siswa[[
    "Id",
    "Nama",
    "SekolahNama",
    "Kelas",
    "Kategori",
    "Nilai",
    "CT_norm",
    "Level_CT"
]]

# simpan ke CSV
df_save_siswa.to_csv(
    "files/data_siswa_klasifikasi.csv",
    index=False,
    float_format="%.3f"
)

print("\nData siswa berhasil disimpan")

Data siswa berhasil disimpan